study/devops/terraform/terraform.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Terraform</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Terraform</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd6e77b0">Resources</a>
<ul>
<li><a href="#orgac34b77">Deploying NixOS with Terraform</a>
<ul>
<li><a href="#org3868e1d">Github Description</a></li>
<li><a href="#org7f16d5d">Tutorial</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1dd27cd">Tutorials</a>
<ul>
<li><a href="#orgf995a32">Terraform Course - Automate your AWS cloud infrastructure</a></li>
</ul>
</li>
<li><a href="#orgf08d3ba">Usage</a></li>
<li><a href="#org3b19e5c">Other</a>
<ul>
<li><a href="#org586657e">OpenTofu</a></li>
<li><a href="#org055261f">terranix</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd6e77b0" class="outline-2">
<h2 id="orgd6e77b0">Resources</h2>
<div class="outline-text-2" id="text-orgd6e77b0">
<p>
<b>Youtube</b>
&gt; <a href="https://www.youtube.com/watch?v=cGPyH-PO8vg">Terraform has forever changed the way I deploy code - Dreams of Code</a>
&gt; <a href="https://youtu.be/tomUWcQ0P3k">Terraform in 100 Seconds - Fireship</a>
</p>
</div>

<div id="outline-container-orgac34b77" class="outline-3">
<h3 id="orgac34b77">Deploying NixOS with Terraform</h3>
<div class="outline-text-3" id="text-orgac34b77">
</div>
<div id="outline-container-org3868e1d" class="outline-4">
<h4 id="org3868e1d">Github Description</h4>
<div class="outline-text-4" id="text-org3868e1d">
<p>
What is a Terraform Module?
</p>

<p>
A Terraform Module refers to a self-contained package of Terraform configurations that are managed as a group. This repo contains a collection of Terraform Modules which can be composed together to create useful infrastructure patterns.
Terraform + Nix vs NixOps
</p>

<p>
NixOps is a great tool for personal deployments. It handles a lot of things like cloud resource creation, machine NixOS bootstrapping and deployment.
</p>

<p>
The difficulty is when the cloud resources are not supported by NixOps. It takes a lot of work to map all the cloud APIs. Compared to NixOps, Terraform has become an industry standard and has thousands of people contributing new cloud API mapping all the time.
</p>

<p>
Another issue is when sharing the configuration as code with multiple developers. Both NixOps and Terraform maintain a state file of "known applied" configuration. Unlike NixOps, Terraform provides facilities to sync and lock the state file so it's available by other users.
</p>

<p>
The approach here is to use Terraform to create all the cloud resources. By using the google<sub>image</sub><sub>nixos</sub><sub>custom</sub> module it's possible to pre-build images in auto-scaling scenarios. Or use a push model similar to NixOps with the generic deploy<sub>nixos</sub> module.
</p>

<p>
So overall Terraform + Nix is more flexible and scales better. But it's also more cumbersome to use as it requires to learn two languages instead of one and the integration between both is also a bit clunky.
Terraform Modules
</p>

<p>
The list of modules provided by this project:
</p>

<p>
deploy<sub>nixos</sub> - deploy NixOS onto running NixOS machines
google<sub>image</sub><sub>nixos</sub> - setup an official GCE image into a Google Cloud Project.
google<sub>image</sub><sub>nixos</sub><sub>custom</sub> - build and deploy a custom GCE image into a Google Cloud Project
</p>

<p>
Using these modules from your terraform configuration
</p>

<p>
Terraform supports importing modules directly from a GitHub repository.
</p>

<p>
For example, to use the deploy<sub>nixos</sub> module:
</p>

<p>
module "deploy<sub>nixos</sub>" {
  source = "github.com/tweag/terraform-nixos//deploy<sub>nixos</sub>?ref=ced68729b6a0382dda02401c8f663c9b29c29368"
</p>

<p>
  … module-specific fields …
}
</p>

<p>
Beware the double //, which separates the github repository url from the subdirectory that contains the module. ?ref= specifies a specific git ref of the repository, in this case the commit ced687….
</p>
</div>
</div>

<div id="outline-container-org7f16d5d" class="outline-4">
<h4 id="org7f16d5d">Tutorial</h4>
<div class="outline-text-4" id="text-org7f16d5d">
<p>
Way to handle resources, similar idea as Chef, Puppet and Ansible.
Only applied to cloud resources.
</p>

<p>
You have a binary like an engine, and resources.
</p>

<p>
Resources provided by a provider, a provider is a plugin mapped to something like Google Cloud.
</p>

<p>
Each of these resources map to a VM, Firewall Config, Disk Image
</p>

<p>
You describe using a <b>Terraform</b> language, using <b>HCL</b>.
Run 
</p>

<p>
Terraform to manage
</p>
<ul class="org-ul">
<li>Linux NixOS</li>
<li>Windows</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org1dd27cd" class="outline-2">
<h2 id="org1dd27cd">Tutorials</h2>
<div class="outline-text-2" id="text-org1dd27cd">
</div>
<div id="outline-container-orgf995a32" class="outline-3">
<h3 id="orgf995a32">Terraform Course - Automate your AWS cloud infrastructure</h3>
<div class="outline-text-3" id="text-orgf995a32">
<p>
&gt; <a href="https://youtu.be/SLB_c_ayRMo">Terraform Course - Automate your AWS cloud infrastructure - freeCodeCamp.org</a> (youtube video)
</p>

<p>
&gt; Create a AWS account.
&gt; Download Terraform executable or install in Linux.
&gt; [Windows] Copy the path of the executable, and add it to the Environment Variables, add to PATH. So you can access from terminal.
</p>

<hr />
</div>
</div>
</div>


<div id="outline-container-orgf08d3ba" class="outline-2">
<h2 id="orgf08d3ba">Usage</h2>
</div>
<div id="outline-container-org3b19e5c" class="outline-2">
<h2 id="org3b19e5c">Other</h2>
<div class="outline-text-2" id="text-org3b19e5c">
</div>
<div id="outline-container-org586657e" class="outline-3">
<h3 id="org586657e">OpenTofu</h3>
<div class="outline-text-3" id="text-org586657e">
<ul class="org-ul">
<li><a href="https://github.com/opentofu/opentofu">OpenTofu - github page</a></li>
<li><a href="https://opentofu.org/docs/intro/core-workflow">The Core OpenTofu Workflow - OpenTofu</a></li>
</ul>

<p>
Download the binary from releases, then add the binary to your PATH.
</p>
</div>
</div>

<div id="outline-container-org055261f" class="outline-3">
<h3 id="org055261f">terranix</h3>
<div class="outline-text-3" id="text-org055261f">
<ul class="org-ul">
<li><a href="https://terranix.org/">Main page - terranix.org</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
